package com.example.wellfit

import android.util.Log

data class Library(var kind:String, var name:String, var content:String)
class LibraryData {
    companion object{
        var libraryList: ArrayList<Library>? = null
        fun initDataList() {
            var list = ArrayList<Library>()
            list.add(Library("arm","바벨 컬","1. 양발을 어깨너비로 적당히 벌려 서고, 바벨을 어깨보다 살짝 넓게 잡고 섭니다.\n2. 팔꿈치를 고정한 상태에서, 이두의 힘으로 바벨을 들어 올립니다.\n 3. 이두의 긴장감을 유지하면서 바벨을 천천히 내립니다."))
            list.add(Library("arm","덤벨 컬","1. 양발을 어깨너비로 적당히 벌리고 양손에 덤벨을 잡습니다.\n2. 이두근으로만 덤벨을 들어올린다는 생가으로 팔을 구부립니다. \n3. 구부린 팔을 펴면서 시작 자세로 돌아갑니다."))
            list.add(Library("arm","덤벨 삼두 익스텐션","1. 양발을 골반 너비로 적당히 벌리고, 덤벨을 양손으로 잡고 섭니다.\n2. 덤벨을 잡은 양팔의 팔꿈치를 직각으로 만들면서 머리 뒤로 넘깁니다. \n3. 팔꿈치를 고정한 상태로 덤벨을 위로 들어올립니다."))
            list.add(Library("arm","덤벨 킥백","1. 덤벨을 쥔 팔의 상완근 부위가 바닥과 평행하도록 자세를 잡습니다.\n2. 팔꿈치를 고정한 상태로 덤벨을 다리쪽으로 멀리 보낸다는 생각으로 들어올립니다. \n3. 삼두근을 일정 시간 수축한 뒤, 덤벨을 내리며 시작 자세로 돌아옵니다."))
            list.add(Library("arm","덤벨 리스트 컬","1. 벤치에 팔을 댄 상태로, 덤벨을 언더 그립으로 잡습니다. \n2. 손목을 아래쪽으로 젖혀주면서 손가락을 살짝 풀어줍니다. \n3. 손가락과 손목을 최대한 높이 말아 올리면서 전완근을 수축시켜줍니다."))
            list.add(Library("arm","덤벨 해머 컬","1. 양 손바닥이 마주보게 덤벨을 잡고, 몸을 굳게 펴고 섭니다. \n2. 팔꿈치를 고정한 상태로, 덤벨을 최대한 들어 올립니다. \n3. 천천히 덤벨을 내려 시작 자세로 돌아옵니다."))
            list.add(Library("arm","케이블 푸시 다운","1. 케이블을 바라본 상태에서, 허리를 살짝 숙이고 엉덩이는 뒤로 빼줍니다. \n2. 어깨와 팔꿈치가 일직선상에 있도록 고정한 상태로, 케이블을 몸 쪽으로 당겨줍니다. 팔꿈치는 최대한 펴줍니다. \n3. 삼두에 자극을 느끼면서 팔꿈치를 천천히 굽혀, 시작 자세로 돌아갑니다."))
            list.add(Library("arm","클로즈그립 푸시업","1. 가슴 아래에 양손을 모아 검지와 엄지 손가락이 '다이아몬드' 형태가 되도록 놓고 푸시업 자세를 취합니다. \n2. 코어에 힘을 주며 바닥으로 천천히 내려갑니다. 이때 팔꿈치는 몸에 최대한 붙여줍니다. \n3. 손바닥으로 바닥을 밀면서 몸을 들어올려 시작 자세로 돌아갑니다."))
            list.add(Library("arm","이지바 컬","1. 양발을 어깨너비로 적당히 벌려 서고, 이지바를 어깨너비만큼 잡고 섭니다. \n2. 팔꿈치를 고정한 상태에서, 이두의 힘으로 바를 들어올립니다. \n3. 이두의 긴장감을 유지하면서 바를 천천히 내립니다."))
            list.add(Library("arm","케이블 컬","1. 그립을 양손으로 잡고 케이블을 바라보고 섭니다. \n2. 팔꿈치를 고정한 상태에서, 이두의 힘으로 케이블을 잡아당깁니다. \n3. 정상지점에서 이두근을 수축시킨 뒤, 팔을 천천히 내려 시작 자세로 돌아갑니다."))
            list.add(Library("back","풀업","1. 팔을 어깨 너비만큼 벌리고, 손바닥이 앞을 바라본 상태로 바를 잡고 매달립니다. \n2. 가슴을 편 상태로 바를 구부려 준다는 느낌으로 팔을 당겨 올라갑니다.\n3. 상체가 흔들리지 않도록 자세를 유지하면서 내려옵니다."))
            list.add(Library("back","바벨 로우","1. 골반너비로 다리를 벌리고, 상체를 숙여 손등이 위로 향하게끔 바벨을 잡습니다. \n2. 허리가 구부러지지 않게 중립 상태를 유지한 채로, 무릎 높이로 바벨을 들어올립니다. \n3. 팔꿈치를 몸쪽으로 붙인다는 생각으로 팔을 굽혀 바벨을 복부까지 끌어당겨 줍니다. 4. 등의 자극을 느끼며 바벨을 내려 2번 자세로 돌아갑니다."))
            list.add(Library("back","덤벨 로우","1. 다리를 골반너비로 벌리고, 상체를 숙여 손등이 위로 향하게끔 덤벨을 잡습니다. \n2. 허리가 구부러지지 않게 중립 상태를 유지한 채로, 무릎 높이로 덤벨을 들어올립니다. \n3. 팔꿈치를 몸쪽으로 붙인다는 생각으로 팔을 굽혀 덤벨을 복부까지 끌어당겨 줍니다. 4. 등의 자극을 느끼며 덤벨을 내려 2번의 자세로 돌아갑니다."))
            list.add(Library("back","펜들레이 로우","1. 어깨너비로 양발을 벌리고 일반적인 데드리프트보다 조금 넓게 바벨을 잡습니다. \n2. 무릎을 살짝 굽히고 등 하부 기립근 쪽을 평평하게 유지하면서, 시선은 전방을 향합니다. \n3. 2번의 자세를 유지하면서 바벨을 복부쪽으로 힘껏 잡아 당깁니다. 4. 바벨을 자연스럽게 바닥으로 내립니다."))
            list.add(Library("back","시티드 로우 머신","1. 기구에 앉아 상체를 고정한 상태에서, 손잡이를 양손으로 잡습니다. \n2. 등이 굽지 않고 곧게 편 상태를 유지하며 팔꿈치를 몸에 붙여 당깁니다. 3. 등의 긴장감을 유지하며 천천히 팔을 펴줍니다.\n"))
            list.add(Library("back","랫풀다운","1. 허벅지 지지대의 높낮이를 알맞게 조절하고, 바를 어깨 너비보다 넓게 잡고 의자에 앉습니다. \n2. 허벅지를 지지대에 고정하고 가슴을 편 상태로, 바가 쇄골에 닿을 정도로 바를 당겨줍니다. \n3. 광배근이 이완하는 것을 느끼면서 천천히 팔을 폅니다."))
            list.add(Library("back","친업","1. 팔을 어깨 너비만큼 벌리고, 손등이 앞을 바라본 상태로 바를 잡고 매달립니다. \n2. 가슴을 편 상태로 팔을 당겨 몸을 끌어올립니다. \n3. 상체가 흔들리지 않도록 자세를 유지하면서 내려옵니다."))
            list.add(Library("back","하이퍼 익스텐션","1. 얼굴이 바닥을 향한 상태로 발 뒤꿈치와 허벅지를 머신에 고정시킵니다. \n2. 양손을 가슴 앞이나 머리 뒤쪽에 고정한 상태로, 등 하부 근육이 이완되는걸 느끼면서 상체를 숙여줍니다. \n3. 등 하부의 자극을 느끼면서, 상체를 들어올립니다."))
            list.add(Library("back","루마니안 데드리프트","1. 다리를 어깨 너비만큼 벌리고, 양손은 다리보다 살짝 넓게 벌려 바벨을 잡고 섭니다. \n2. 시선은 전방을 향한 상태에서 바벨을 들어올려 골반 높이에 위치시킵니다. \n3. 허리와 등을 편 상태로 상체를 숙여 바벨을 무릎 높이까지 천천히 내립니다. 4. 바벨이 내려간 역순서대로 들어올려 2번의 자세로 돌아갑니다."))
            list.add(Library("back","시티드 케이블 로우","1. 의자에 앉아 상체를 고정하고 손잡이를 양손으로 잡습니다. \n2. 허리를 펴고 가슴을 내민 상태에서, 등 중앙부를 접는다는 느낌으로 팔꿈치를 몸에 붙여 당깁니다. \n3. 등의 긴장감을 유지하며 천천히 팔을 펴줍니다."))
            list.add(Library("chest","벤치프레스","1. 벤치에 가슴을 펴고 누운 상태에서, 바벨을 어깨 너비보다 조금 넓게 잡고 위로 들어올립니다. \n2. 가슴 근육의 이완을 느끼며 팔을 굽혀 바벨을 가슴 방향으로 내립니다. \n3. 가슴 근육의 수축을 느끼며 몸의 수직 방향으로 바벨을 밀어 올립니다."))
            list.add(Library("chest","인클라인 벤치프레스","1. 기울어진 벤치에 가슴을 펴고 누운 상태에서, 바벨을 어깨 너비보다 조금 넓게 잡고 위로 들어 올립니다. \n2. 가슴 근육의 이완을 느끼며 팔을 굽혀 바벨을 가슴 방향으로 내립니다. \n3. 가슴 근육의 수축을 느끼며 바닥의 수직 방향으로 바벨을 밀어 올립니다."))
            list.add(Library("chest","덤벨 벤치프레스","1. 덤벨을 양손에 들고 벤치에 가슴을 펴고 누운 상태에서, 덤벨을 수직으로 들어올립니다. \n2. 덤벨이 가로로 놓이게 잡아주고, 가슴 근육의 이완을 느끼며 팔을 굽히며 덤벨을 아래로 내립니다. \n3. 가슴 근육의 수축을 느끼며 몸의 수직 방향으로 덤벨을 밀어 올립니다."))
            list.add(Library("chest","인클라인 덤벨 벤치프레스","1. 덤벨을 양손에 들고 기울어진 벤치에 가슴을 펴고 누운 상태에서, 덤벨을 바닥에 수직하게 들어 올립니다. \n2. 덤벨이 가로로 놓이게 잡아주고, 가슴 근육의 이완을 느끼며 팔을 굽혀 덤벨을 아래로 내립니다. \n3. 가슴 근육의 수축을 느끼며 수직 방향으로 덤벨을 밀어 올립니다."))
            list.add(Library("chest","딥스","1. 딥스바의 폭을 어깨보다 살짝 넓게 셋팅한 상태에서, 손목이 꺾이지 않게 딥스바에 올라갑니다. \n2. 상체는 살짝 앞으로 기울인 상태로 팔꿈치가 90도가 될 때까지 팔을 굽혀 몸을 내립니다. \n3. 상체의 균형을 유지한채로 팔을 펴면서 올라옵니다."))
            list.add(Library("chest","덤벨 플라이","1. 벤치에 등을 대고 누운 뒤 손바닥을 서로 마주보게 덤벨을 잡아, 가슴 위로 양팔을 쭉 밀어 올립니다. \n2. 팔꿈치는 자연스럽게 살짝 구부리면서 가슴 옆방향으로 팔을 천천히 펼쳐줍니다. \n3. 팔로 반원을 그리며 덤벨을 모아 시작 자세로 돌아옵니다."))
            list.add(Library("chest","케이블 크로스오버","1. 양손으로 그립을 각각 잡고 머신 중앙에 자리 잡습니다. \n2. 상체는 살짝 앞으로 숙이고 무릎도 살짝 굽힌 상태로, 가슴 근육을 모아준다는 생각으로 양팔을 아래 방향으로 끌어 내려줍니다. \n3. 가슴에 자극을 유지하면서 천천히 시작 자세로 돌아갑니다."))
            list.add(Library("chest","체스트 프레스 머신","1. 가슴을 활짝 편 상태로, 의자에 윗 등을 붙이고 앉습니다. \n2. 양손으로 손잡이를 잡고, 가슴에 힘을 주면서 앞으로 밍러줍니다. \n3. 가슴 근육의 이완을 느끼면서 팔꿈치를 뒤로 천천히 이동합니다."))
            list.add(Library("chest","펙덱 플라이 머신","1. 팔과 팔꿈치가 가슴 중앙에 위치할 수 있도록 머신을 조절한 후, 가슴을 펴고 의자에 앉습니다. \n2. 팔꿈치는 직각을 만들어 패드에 붙이고, 팔을 가슴 안쪽으로 모아줍니다. \n3. 가슴의 이완에 집중하면서 팔을 벌립니다.\n"))
            list.add(Library("chest","푸시업","1. 양팔을 가슴 옆에 두고 바닥에 엎드립니다. \n2. 복근과 둔근에 힘을 준 상태로 팔꿈치를 피며 올라옵니다. \n3. 천천히 팔꿈치를 굽히며 시작 자세로 돌아갑니다."))
            list.add(Library("lower_body","바벨 백스쿼트","1. 다리를 어깨너비만큼 벌리고, 바벨을 등 뒤 어깨 위에 올려줍니다.\n" +
                    "2. 상체가 앞으로 숙여지지 않도록 코어에 힘을 준 상태로 엉덩이를 뒤로 빼며 앉습니다.\n" +
                    "3. 상체의 자세를 유지하면서, 발바닥으로 지면을 밀고 일어나면서 1번의 자세로 돌아옵니다."))
            list.add(Library("lower_body","컨벤셔널 데드리프트","1. 양발을 골반보다 약간 넓게 벌리고, 바벨의 그립을 어깨보다 조금 넓게하여 무릎과 팔이 겹치지 않도록 합니다.\n" +
                    "2. 등이 굽지 않도록 상체를 곧게 유지하면서, 발바닥으로 지면을 밀어올린다는 느낌으로 바벨을 들어 올립니다.\n" +
                    "3. 몸을 완전히 쭉 피고 엉덩이 근육을 수축합니다.\n" +
                    "4. 바벨을 들어올린 역순서대로 바닥으로 내려 시작 자세로 돌아갑니다."))
            list.add(Library("lower_body","프론트 스쿼트","1. 바벨을 어깨 너비로 잡고 쇄골 위에 올려둡니다.\n" +
                    "2. 시선은 정면을 유지하면서, 엉덩이를 뒤로 빼며 앉습니다.\n" +
                    "3. 가슴을 펴고 허리를 곧게 세워 상체를 편 상태로, 발바닥으로 지면을 지긋이 누르며 일어납니다."))
            list.add(Library("lower_body","레그 프레스","1. 엉덩이와 허리가 의자에 완전히 붙도록 밀착하여 앉고, 두 발을 어깨 너비만큼 벌려줍니다.\n" +
                    "2. 안전핀을 제거하고, 중량의 자극을 느끼며 무릎을 굽혀줍니다. 엉덩이와 허리가 뜨지않을 깊이까지 중량판을 내립니다.\n" +
                    "3. 복부에 힘을 유지한채로, 중량판을 지긋이 밀어 올립니다."))
            list.add(Library("lower_body","레그 컬","1. 머신에 엎드린 상태에서, 종아리 쪽의 패드가 아킬레스 건 바로 위쪽에 위치하도록 머신을 조정합니다.\n" +
                    "2. 발목을 세운 상태에서, 무릎을 굽혀 기구를 올려줍니다.\n" +
                    "3. 허리, 엉덩이, 햄스트링에 긴장감을 유지하면서 기구를 천천히 내립니다."))
            list.add(Library("lower_body","레그 익스텐션","1. 의자는 무릎 바로 아래에 올 수 있게, 패드는 발목 살짝 위에 위치할 수 있도록 머신을 조정합니다.\n" +
                    "2. 엉덩이가 떨어지지 않게 유지하면서, 허벅지의 힘으로 고정부위를 지긋이 밀어올립니다.\n" +
                    "3. 근육의 긴장을 유지하면서 천천히 무릎을 굽혀줍니다."))
            list.add(Library("lower_body","덤벨 런지","1. 양발을 골반 너비만큼 벌리고 덤벨을 양손에 든 상태로 상체를 곧게 펴고 섭니다.\n" +
                    "2. 한쪽 다리를 뻗어 앞으로 나가면서 두 무릎이 90도 각도를 이룰 때까지 엉덩이를 낮춰줍니다. 이때 상체와 등은 곧게 편 자세를 유지합니다.\n" +
                    "3. 앞발의 뒤꿈치에 무게 중심을 실어서 몸을 위쪽으로 밀어주며 원래 시작 자세로 돌아옵니다."))
            list.add(Library("lower_body","스모 데드리프트","1. 발끝이 바깥을 향한 상태로 다리를 넓게 벌리고 바벨 앞에 섭니다.\n" +
                    "2. 허벅지가 바닥에 수평이 될 때까지 엉덩이를 뒤로 뺀 상태에서, 양팔은 어깨너비보다 좁게 바벨을 잡습니다.\n" +
                    "3. 복압을 유지한 채로 엉덩이에 힘을 주며 다리를 펴줍니다.\n" +
                    "4. 상체를 포함한 온몸이 펴지면 동작을 완료하고, 바벨이 올라온 역순서대로 바닥에 내려 시작 자세로 돌아갑니다."))
            list.add(Library("lower_body","점프 스쿼트","1. 다리를 어깨너비만큼 벌리고 허리를 펴고 곧게 섭니다.\n" +
                    "2. 가슴을 편 상태로 엉덩이를 뒤로 빼며 앉습니다.\n" +
                    "3. 복근에 힘을 주고 골반을 밀어 올리면서 최대한 높이 뛰어오릅니다.\n" +
                    "4. 착지하면서 2번의 자세로 돌아갑니다."))
            list.add(Library("lower_body","스미스머신 데드리프트","1. 양발을 골반보다 약간 넓게 벌리고, 바벨의 그립을 어깨보다 조금 넓게하여 무릎과 팔이 겹치지 않도록 합니다.\n" +
                    "2. 등이 굽지 않도록 상체를 곧게 유지하면서, 발바닥으로 지면을 밀어올린다는 느낌으로 바벨을 들어 올립니다.\n" +
                    "3. 몸을 완전히 쭉 피고 엉덩이 근육을 수축합니다.\n" +
                    "4. 바벨을 들어올린 역순서대로 바닥으로 내려 시작 자세로 돌아갑니다."))
            list.add(Library("shoulder","오버헤드 프레스","1. 바벨을 어깨 너비로 잡고 쇄골 위에 올려둡니다.\n2. 등에 힘을 주고 가슴을 펴면서 바벨을 위로 밀어올립니다.\n3. 바벨이 올라간 동선을 따라 천천히 내려 시작 자세로 돌아옵니다."))
            list.add(Library("shoulder","덤벨 숄더 프레스","1. 양손에 덤벨을 잡고 팔을 옆으로 벌려서, 덤벨을 머리와 나란히 위치시킵니다.\n2. 어깨를 아래방향으로 지긋이 누르면서 덤벨을 수직 방향으로 밀어올립니다.\n3. 어깨의 자극을 느끼면서, 덤벨을 내려 시작 자세로 돌아옵니다."))
            list.add(Library("shoulder","덤벨 레터럴 레이즈","1. 양발을 어깨너비로 적당히 벌리고, 가슴을 편 상태로 덤벨을 잡습니다.\n2. 측면 어깨에 자극을 느끼면서 팔꿈치를 올린다는 생각으로 덤벨을 들어올립니다.\n3. 측면 삼각근의 자극을 느끼면서 천천히 팔을 내립니다."))
            list.add(Library("shoulder","덤벨 프론트 레이즈","1. 양발을 어깨너비로 적당히 벌리고, 양손에 덤벨을 쥐고 섭니다.\n2. 상체의 균형을 유지하면서 양쪽 팔을 앞으로 들어올립니다.\n3. 어깨의 자극을 느끼면서 천천히 팔을 내립니다."))
            list.add(Library("shoulder","덤벨 슈러그","1. 발을 어깨너비로 벌린 상태에서, 양손에 덤벨을 들어 허벅지 옆에 위치시킵니다.\n2. 어깨를 귀에 붙인다는 느낌으로 최대한 어깨를 끌어올립니다.\n3. 승모근에 저항감을 느끼면서 어깨를 천천히 내리고 시작 자세로 돌아갑니다."))
            list.add(Library("shoulder","비하인드 넥 프레스","1. 바벨을 어깨너비 두 배 정도로 넓게 잡고 위로 들어올립니다.\n2. 팔꿈치와 손목을 1자로 유지하면서, 바벨을 천천히 머리 뒤로 내립니다.\n3. 어깨에 자극을 유지하면서 천천히 바벨을 밀어 올립니다."))
            list.add(Library("shoulder","페이스 풀","1. 케이블을 머리 높이에 고정한 뒤, 케이블을 바라보고 섭니다.\n2. 양손으로 로프를 잡은 뒤, 가슴을 편 상태로 로프를 얼굴 방향으로 힘껏 당깁니다.\n3. 팔을 펴면서 시작 자세로 돌아갑니다."))
            list.add(Library("shoulder","핸드스탠드 푸시업","1. 양팔을 쭉 펴고 물구나무를 섭니다.\n2. 균형을 유지할 수 있는 깊이 만큼 팔꿈치를 굽혀 내려갑니다.\n3. 팔꿈치를 펴고 몸을 밀어 올려서, 1번의 상태로 돌아갑니다."))
            list.add(Library("shoulder","케이블 리버스 플라이","1. 팔을 교차하여 케이블을 잡고 머신 중앙에 자리 잡습니다.\n2. 팔꿈치를 살짝 굽히며 잡은 케이블을 살짝 당깁니다.\n3. 팔꿈치의 각도를 일정하게 유지하면서 케이블을 뒤로 힘차게 잡아당깁니다. 4. 후면 삼각근의 자극을 느끼면서 천천히 시작 자세로 돌아옵니다."))
            list.add(Library("shoulder","벤트오버 덤벨 레터럴 레이즈","1. 양발을 어깨너비로 적당히 벌리고, 허리를 곧게 편 상태로 상체를 숙여줍니다.\n2. 팔꿈치를 살짝 굽힌 상태에서, 덤벨을 든 양 손을 어깨와 1자가 되게끔 들어올립니다.\n3. 어깨 뒤편의 자극을 느끼면서 덤벨을 천천히 내려줍니다."))
            libraryList = list
        }
        fun getList(kind:String): ArrayList<Library>? {
            var list = ArrayList<Library>()
            if (libraryList != null){
                for(i in libraryList!!){
                    if(i.kind == kind){
                        list.add(i)
                    }
                }
            }
            return list
        }
    }
}